app/views/carts/_cart_items.html.erb

SELECT  "images".* FROM "images" WHERE "images"."product_id" = ? ORDER BY "images"."id" ASC LIMIT ?  [["product_id", 3], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
                    <tr>
                      <td class="thumb"><%= image_tag item.product.images.first.image_url %></td>