app/views/homes/index.html.erb

SELECT  "images".* FROM "images" WHERE "images"."product_id" = ? ORDER BY "images"."id" ASC LIMIT ?  [["product_id", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."category_id" = ?  [["category_id", 1]]
---
              </ul>
              <%= image_tag category.products.first.images.first.image_url %>