app/controllers/categories_controller.rb

  def show
    @category = Category.find(params[:id])
    @products = @category.products.all.page(params[:page]).per(CATEGORY_PAGINATES_PER)
    @order_item = current_user.cart.order_items.new
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."category_id" = ? LIMIT ? OFFSET ?  [["category_id", 1], ["LIMIT", 9], ["OFFSET", 0]]
SELECT "categories".* FROM "categories"
SELECT COUNT(*) FROM "products" WHERE "products"."category_id" = ?  [["category_id", 1]]
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]