app/controllers/homes_controller.rb

  def index
    @products = @q.result(distinct: true).page(params[:page]).per(HOME_PAGINATES_PER)
    if current_user
      @cart = current_user.cart
      @order_item = @cart.order_items.new
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]