app/controllers/order_items_controller.rb

  def create
    @cart = current_user.cart
    product = Product.find(params[:product_id])
    @order_item = @cart.add_product(product.id)
    @cart.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "order_items" ("product_id", "order_id", "unit_price", "quantity", "total_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["product_id", 3], ["order_id", 1], ["unit_price", 450000.0], ["quantity", 1], ["total_price", 450000.0], ["created_at", "2020-03-11 23:46:08.850839"], ["updated_at", "2020-03-11 23:46:08.850839"]]
INSERT INTO "orders" ("subtotal", "created_at", "updated_at") VALUES (?, ?, ?)  [["subtotal", 450000.0], ["created_at", "2020-03-11 23:46:08.844254"], ["updated_at", "2020-03-11 23:46:08.844254"]]
UPDATE "order_items" SET "quantity" = ?, "updated_at" = ? WHERE "order_items"."id" = ?  [["quantity", 2], ["updated_at", "2020-03-16 09:42:47.841579"], ["id", 35]]
UPDATE "orders" SET "subtotal" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["subtotal", 900000.0], ["updated_at", "2020-03-11 23:49:10.889969"], ["id", 1]]

  def update
    @cart = current_user.cart
    @order_item = @cart.order_items.find(params[:id])
    @order_item.update_attributes(order_item_params)
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT  "order_items".* FROM "order_items" WHERE "order_items"."cart_id" = ? AND "order_items"."id" = ? LIMIT ?  [["cart_id", 1], ["id", 32], ["LIMIT", 1]]
UPDATE "order_items" SET "quantity" = ?, "updated_at" = ? WHERE "order_items"."id" = ?  [["quantity", 3], ["updated_at", "2020-03-17 08:22:13.059482"], ["id", 32]]

  def destroy
    @cart = current_user.cart
    @order_item = @cart.order_items.find(params[:id])
    @order_item.destroy
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ? AND "order_items"."id" = ? LIMIT ?  [["order_id", 1], ["id", 3], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "order_items" WHERE "order_items"."id" = ?  [["id", 25]]

  def set_order_item
    @order_item = OrderItem.find_by(params[:id])
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]