app/controllers/products_controller.rb

  def show
    @product = Product.find(params[:id])
    if current_user
      @order_item = current_user.cart.order_items.new
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]