app/views/categories/show.html.erb

SELECT  "images".* FROM "images" WHERE "images"."product_id" = ? ORDER BY "images"."id" ASC LIMIT ?  [["product_id", 1], ["LIMIT", 1]]
---
                    </div>
                    <%= image_tag product.images.first.image_url.url %>