app/views/products/index.html.erb

                    <button class="main-btn quick-view"><i class="fa fa-search-plus"></i>Quick view</button>
                    <%= image_tag product.images.first.image_url.url %>
---
SELECT  "images".* FROM "images" WHERE "images"."product_id" = ? ORDER BY "images"."id" ASC LIMIT ?  [["product_id", 5], ["LIMIT", 1]]