app/views/products/show.html.erb

            <div id="product-main-view">
              <% @product.images.each do |img| %>
---
SELECT "images".* FROM "images" WHERE "images"."product_id" = ?  [["product_id", 1]]