app/views/layouts/_cart.html.erb

<%= link_to "#{current_user.cart.order_items.size}" %>
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ? AND "order_items"."id" = ? LIMIT ?  [["order_id", 1], ["id", 3], ["LIMIT", 1]]
SELECT COUNT(*) FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]