app/views/layouts/_header.html.erb

            <%= f.search_field :name_cont, class: "input search-input", placeholder: "Enter your keyword" %>
            <%= f.select :category_id_eq, options_from_collection_for_select(Category.all, "id", "name"), {include_blank: "All Category"}, {class: "input search-categories"} %>
---
SELECT "categories".* FROM "categories"